src/Reports/ОтчетОИспользованииЛьготПоПодоходномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОИспользованииЛьготПоПодоходномуНалогу</Name>
			<Comment>Отчет о использовании льгот по подоходному налогу</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетЛичный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетНаДетей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНалоговогоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетИмущественныйРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетСоциальныйСПроцентами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетНаДетейИнвалидов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйвычетДополнительный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетНаДетейЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогПоСтавке09</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогПоСтавке9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогПоСтавке35</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогПоСтавке40</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримененныйВычетСтраховойРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/НДФЛРасчетыСБюджетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НДФЛРасчетыСБюджетом</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетЛичный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетейИнвалидов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетНаДетейЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйДополнительныйВычет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычетМолодыеСпециалисты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛРасчетыСБюджетомВидСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсчисленоИзЗарплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ГражданствоФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/НДФЛСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НДФЛСведенияОДоходах</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалогаИсчисленная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсчисленоИзЗарплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ОтчетОИспользованииЛьготПоПодоходномуНалогу/Ext/ObjectModule.bsl
Процедура РассчитатьНДФЛ(Физлицо = Неопределено, КомментироватьРасчет = Ложь) Экспорт
	
	//СВЭЙ 10.04.2024 КВВ СВФР-012811 (
	_парамФизлицо_ = Неопределено;
	_СписокФизЛиц_ = Неопределено;
	//СВЭЙ 10.04.2024 КВВ СВФР-012811 )
	
	// Составим текст запроса для выбора списка физлиц, по которым надо считать НДФЛ
	Если НЕ (Физлицо = Неопределено) Тогда
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций.НДФЛ КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор и Работники.Физлицо = &парамФизлицо";
		
		ДополнительныеПараметрыЗапросаНДФЛ  = Новый Структура;
		ДополнительныеПараметрыЗапросаНДФЛ.Вставить("парамФизлицо", Физлицо);
		
		_парамФизлицо_ = Физлицо; //СВЭЙ 10.04.2024 КВВ СВФР-012811
	Иначе
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизаций.Физлицо КАК Физлицо
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Физлицо В(&СписокФизЛиц)";
		
		ДополнительныеПараметрыЗапросаНДФЛ  = Новый Структура;
		ДополнительныеПараметрыЗапросаНДФЛ.Вставить("СписокФизЛиц", НДФЛ.ВыгрузитьКолонку("ФизЛицо"));
		
		_СписокФизЛиц_ = НДФЛ.ВыгрузитьКолонку("ФизЛицо"); //СВЭЙ 10.04.2024 КВВ СВФР-012811
	КонецЕсли;
	
	// получение результата НДФЛ по ставке 13 процентов
	// для него передается Организация, период и ссылка на регистратор
	ВыборкаПоШапкеДокумента = Новый Структура;
	ВыборкаПоШапкеДокумента.Вставить("Организация", Организация);
	
	ВыборкаПодразделений = "";
	//Островская Татьяна 11.12.2012 № Исправление(по запросу в общем модуле)
	СсылкаОтчет = Истина;
	ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Документы.НачислениеЗарплатыРаботникамОрганизаций.ПустаяСсылка(), СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , КомментироватьРасчет, ВыборкаПодразделений,СсылкаОтчет,,,_парамФизлицо_,,_СписокФизЛиц_); //СВЭЙ 10.04.2024 КВВ СВФР-012811 (_парамФизлицо_,_СписокФизЛиц_)
	//Островская Татьяна 11.12.2012 № Исправление
	//ДанныеНДФЛ = ПолучитьДанныеРасчетов(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Документы.НачислениеЗарплатыРаботникамОрганизаций.ПустаяСсылка(), СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , КомментироватьРасчет, ВыборкаПодразделений);
	Если ДанныеНДФЛ <> Неопределено Тогда
		Если НЕ (Физлицо = Неопределено) Тогда
			// считаем одно физлицо
			ФизлицаСписок = Новый СписокЗначений;
			ФизлицаСписок.Добавить(Физлицо);
		Иначе
			// считаем всех
			ФизлицаСписок = НеОпределено;
		КонецЕсли;
		ЗаполнитьНаборЗаписейПоДаннымНДФЛ(, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, ,ФизлицаСписок, КомментироватьРасчет, ВыборкаПодразделений);
	КонецЕсли;
//толик НДФЛ

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Беларусь", Справочники.КлассификаторСтранМира.БЕЛАРУСЬ);
	Запрос.УстановитьПараметр("парамРегистратор", Документы.НачислениеЗарплатыРаботникамОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
	Запрос.УстановитьПараметр("парамСтавка9", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9);
	Запрос.УстановитьПараметр("парамСтавка09", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
	Запрос.УстановитьПараметр("парамСтавка35", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	Запрос.УстановитьПараметр("парамСтавка40", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40);
	Запрос.УстановитьПараметр("парамСтавкаРезидента9", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9));
	Запрос.УстановитьПараметр("парамСтавкаРезидента09", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09));
	Запрос.УстановитьПараметр("парамСтавкаРезидента35", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35));
	Запрос.УстановитьПараметр("парамСтавкаРезидента40", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40));

	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамКонецМесяцаНалоговогоПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамВидСтрокиНачисление", Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
	Запрос.УстановитьПараметр("парамВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("парамПустаяДата" , '00010101');
	Запрос.УстановитьПараметр("парамСсылка" , Документы.НачислениеЗарплатыРаботникамОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПустойКодДохода" , Справочники.ДоходыНДФЛ.ПустаяСсылка());
	
	// установим дополнительные параметры
	Если ДополнительныеПараметрыЗапросаНДФЛ <> Неопределено Тогда
		Для каждого Поле Из ДополнительныеПараметрыЗапросаНДФЛ Цикл
			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
		КонецЦикла;
	КонецЕсли;

	Запрос.Текст = СписокФизлицТекст;
	// Ранее расчитанные налоги
	РанееНачисленныеНалогиТекст = 
	"ВЫБРАТЬ
	|	РасчетыСБюджетом.ФизЛицо,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке9,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке09,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке35,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке40
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК РасчетыСБюджетом
	|
	|ГДЕ
	|	РасчетыСБюджетом.Организация = &парамГоловнаяОрганизация И
	|	РасчетыСБюджетом.Период <= &парамКонецМесяцаНалоговогоПериода И //парамПериодРегистрации И
	|	(РасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаНалоговогоПериода ИЛИ РасчетыСБюджетом.МесяцНалоговогоПериода = &парамКонецМесяцаНалоговогоПериода) И
	|	РасчетыСБюджетом.Регистратор <> &парамРегистратор И
	|	РасчетыСБюджетом.ВидДвижения = &парамВидДвиженияПриход И
	|	РасчетыСБюджетом.ФизЛицо В(" + СписокФизЛицТекст + ") И
	|	РасчетыСБюджетом.ВидСтроки = &парамВидСтрокиНачисление
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСБюджетом.ФизЛицо";
	 
	// Составим текст запроса для выбора списка физлиц, по которым надо считать НДФЛ (исключим нерезидентов)
	СписокФизлицРезидентовТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.ФизЛицо
	|ИЗ
	|	Документ.НачислениеЗарплатыРаботникамОрганизаций.НДФЛ КАК ТЧРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамКонецГода) КАК НеРезиденты
	|		ПО НеРезиденты.ФизЛицо = ТЧРаботникиОрганизации.ФизЛицо
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &парамРегистратор И
	|	(((НеРезиденты.ФизЛицо) ЕСТЬ NULL ) ИЛИ ((НеРезиденты.Страна)=&Беларусь))
	|	И ТЧРаботникиОрганизации.ФизЛицо В(" + СписокФизЛицТекст + ")";
	
	Запрос.Текст = СписокФизлицРезидентовТекст;
	// НачислениеНалоговТекст
	НачислениеНалоговТекст = 
	"ВЫБРАТЬ
	|	НДФЛОбороты.ФизЛицо КАК ФизЛицо,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента9/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке9,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента09/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке09,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента35/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке35,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента40/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке40
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах.Обороты(&парамНачалоГода, &парамКонецМесяцаНалоговогоПериода, Месяц, ПериодРегистрации <= &парамПериодРегистрации И Организация = &парамГоловнаяОрганизация И ВЫБОР КОГДА Физлицо В (" + СписокФизлицРезидентовТекст + ") ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК НДФЛОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛОбороты.ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалогиПоСтавкам.Физлицо,
	|	Сумма(НалогиПоСтавкам.Налог9) КАК НалогПоСтавке9,
	|	Сумма(НалогиПоСтавкам.Налог09) КАК НалогПоСтавке09,
	|	Сумма(НалогиПоСтавкам.Налог35) КАК НалогПоСтавке35,
	|	Сумма(НалогиПоСтавкам.Налог40) КАК НалогПоСтавке40
	|ИЗ
	|(ВЫБРАТЬ
	|	Доходы.Физлицо,
	|	ВЫБОР КОГДА Доходы.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА СУММА(Доходы.СуммаДохода)*&парамСтавкаРезидента9/100 ИНАЧЕ 0 КОНЕЦ КАК Налог9,
	|	ВЫБОР КОГДА Доходы.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА СУММА(Доходы.СуммаДохода)*&парамСтавкаРезидента09/100 ИНАЧЕ 0 КОНЕЦ КАК Налог09,
	|	ВЫБОР КОГДА Доходы.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА СУММА(Доходы.СуммаДохода)*&парамСтавкаРезидента35/100 ИНАЧЕ 0 КОНЕЦ КАК Налог35,
	|	ВЫБОР КОГДА Доходы.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА СУММА(Доходы.СуммаДохода)*&парамСтавкаРезидента40/100 ИНАЧЕ 0 КОНЕЦ КАК Налог40
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основные.Физлицо КАК Физлицо,
	|		Основные.ВидРасчета.КодДоходаНДФЛ КАК КодДохода,
	|		Основные.ДатаНачала КАК Период,
	|		Основные.Результат КАК СуммаДохода
	|	ИЗ
	|		Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК Основные
	|	
	|	ГДЕ
	|		Основные.Ссылка = &парамСсылка И
	|		Основные.ВидРасчета.КодДоходаНДФЛ <> &парамПустойКодДохода И
	|		(Основные.Результат <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Дополнительные.Физлицо,
	|		Дополнительные.ВидРасчета.КодДоходаНДФЛ,
	|		ВЫБОР КОГДА Дополнительные.ДатаНачала = &парамПустаяДата ТОГДА Дополнительные.Ссылка.ПериодРегистрации ИНАЧЕ Дополнительные.ДатаНачала КОНЕЦ,
	|		Дополнительные.Результат
	|	ИЗ
	|		Документ.НачислениеЗарплатыРаботникамОрганизаций.ДополнительныеНачисления КАК Дополнительные
	|	
	|	ГДЕ
	|		Дополнительные.Ссылка = &парамСсылка И
	|		Дополнительные.ВидРасчета.КодДоходаНДФЛ <> &парамПустойКодДохода И
	|		(Дополнительные.Результат <> 0)) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Физлицо,
	|	Доходы.КодДохода,
	|	Доходы.Период) КАК НалогиПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиПоСтавкам.ФизЛицо";
	
	НачислениеНалоговТекст1 = 
	"ВЫБРАТЬ
	|	НДФЛОбороты.ФизЛицо КАК ФизЛицо,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента9/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке9,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента09/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке09,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента35/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке35,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента40/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке40
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах.Обороты(&парамНачалоГода, &парамКонецМесяцаНалоговогоПериода, Месяц, ПериодРегистрации <= &парамПериодРегистрации И Организация = &парамГоловнаяОрганизация И ВЫБОР КОГДА Физлицо В (" + СписокФизлицРезидентовТекст + ") ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК НДФЛОбороты
	|ГДЕ
	|	НДФЛОбороты.ФизЛицо В(" + СписокФизЛицТекст + ")
	|СГРУППИРОВАТЬ ПО
	|	НДФЛОбороты.ФизЛицо";
	
	Запрос.Текст = НачислениеНалоговТекст1;

	//Запрос.Текст = НачислениеНалоговТекст;
	// Объединение запросов
	НалогиТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.ФизЛицо ИНАЧЕ РанееНачислено.ФизЛицо КОНЕЦ КАК ФизЛицо,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке9 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке9 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке9,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке09 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке09 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке09,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке35,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке40 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке40
	| ИЗ (" + НачислениеНалоговТекст1 + ") КАК НачисленныеНалоги
	|   ПОЛНОЕ СОЕДИНЕНИЕ (" +РанееНачисленныеНалогиТекст + ") КАК РанееНачислено
	|	ПО РанееНачислено.ФизЛицо = НачисленныеНалоги.ФизЛицо
	|";
	
	
	Запрос.Текст = РанееНачисленныеНалогиТекст;
	Запрос.Текст = НалогиТекст;
	ДанныеНДФЛТвердые = Запрос.Выполнить().Выбрать();
	
	
	СтруктураПоиска = Новый Структура("ФизЛицо");
	
	Пока ДанныеНДФЛТвердые.Следующий() Цикл
		СтруктураПоиска.Физлицо = ДанныеНДФЛТвердые.ФизЛицо;
		Строки = НДФЛ.НайтиСтроки(СтруктураПоиска);
		Если Строки.Количество() > 0 Тогда
			Строка = Строки[0];
		Иначе
			Строка = НДФЛ.Добавить();
			Строка.ФизЛицо 						= ДанныеНДФЛ.ФизЛицо;
			Строка.МесяцНалоговогоПериода 		= ПериодРегистрации;
		КонецЕсли;
		
		Если  ДанныеНДФЛТвердые.НалогПоСтавке9<>0 тогда
			Строка.НалогПоСтавке9 = Строка.НалогПоСтавке9 + ДанныеНДФЛТвердые.НалогПоСтавке9;
		КонецЕсли;
		
		Если  ДанныеНДФЛТвердые.НалогПоСтавке09<>0 тогда
			Строка.НалогПоСтавке09 = Строка.НалогПоСтавке09 + ДанныеНДФЛТвердые.НалогПоСтавке09;
		КонецЕсли;
		
		Если  ДанныеНДФЛТвердые.НалогПоСтавке35<>0 тогда
			Строка.НалогПоСтавке35 = Строка.НалогПоСтавке35 + ДанныеНДФЛТвердые.НалогПоСтавке35;
		КонецЕсли;
		
		Если  ДанныеНДФЛТвердые.НалогПоСтавке40<>0 тогда
			Строка.НалогПоСтавке40 = Строка.НалогПоСтавке40 + ДанныеНДФЛТвердые.НалогПоСтавке40;
		КонецЕсли;
		
	КонецЦикла;
	
    //очищаем пустые
	Для Каждого мСтрока Из НДФЛ Цикл
		Если мСтрока.МесяцНалоговогоПериода > КонецМесяца(ПериодРегистрации) Тогда
			мСтрока.Налог = 0;
		КонецЕсли;
	КонецЦикла;
	ТаблицаПустыхСтрок = НДФЛ.НайтиСтроки(Новый Структура("Налог", 0));
	//таня
	Для Каждого мСтрока Из ТаблицаПустыхСтрок Цикл
		если мСтрока.ПримененныйВычетИмущественныйРасход=0 и мСтрока.ПримененныйВычетЛичный=0 и мСтрока.ПримененныйВычетНаДетей=0 и мСтрока.ПримененныйВычетНаДетейИнвалидов=0 и
			мСтрока.ПримененныйВычетНаДетейЛьгота=0 и мСтрока.ПримененныйВычетСоциальныйСПроцентами=0 и мСтрока.ПримененныйВычетСтраховойРасход=0 и мСтрока.ПримененныйвычетДополнительный Тогда 
			НДФЛ.Удалить(мСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПустыхСтрок = НДФЛ.Выгрузить();
	ТаблицаПустыхСтрок.Свернуть("ФизЛицо", "Налог");
	
	ТаблицаПустыхСтрокСумма = ТаблицаПустыхСтрок.НайтиСтроки(Новый Структура("Налог", 0));
	Для Каждого мСтрокаФизЛицо Из ТаблицаПустыхСтрокСумма Цикл
		ТаблицаПустыхФизЛиц = НДФЛ.НайтиСтроки(Новый Структура("ФизЛицо", мСтрокаФизЛицо.ФизЛицо));
		Для Каждого мСтрока Из ТаблицаПустыхФизЛиц Цикл
			если мСтрока.ПримененныйВычетИмущественныйРасход=0 и мСтрока.ПримененныйВычетЛичный=0 и мСтрока.ПримененныйВычетНаДетей=0 и мСтрока.ПримененныйВычетНаДетейИнвалидов=0 и
			мСтрока.ПримененныйВычетНаДетейЛьгота=0 и мСтрока.ПримененныйВычетСоциальныйСПроцентами=0 и мСтрока.ПримененныйВычетСтраховойРасход=0 и мСтрока.ПримененныйвычетДополнительный Тогда 
			НДФЛ.Удалить(мСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры  // РассчитатьНДФЛ

//Функция  ПолучитьДанныеРасчетов(Знач ПервыйМесяцНалоговогоПериода,
//	Знач ПоследнийМесяцНалоговогоПериода,
//	ПериодРегистрации,
//	ОбособленноеПодразделение,
//	Организация,
//	Регистратор,
//	Знач СписокФизЛицТекст,
//	ДополнительныеПараметрыЗапроса = Неопределено,
//	ЭтоПерерасчет = Ложь,
//	КомментироватьРасчет = Ложь,
//	ВыборкаПодразделений)
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("парамОрганизация",			Организация);
//	Запрос.УстановитьПараметр("парамРегистратор",			Регистратор);
//	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", ОбособленноеПодразделение);
//	Запрос.УстановитьПараметр("парамПериодРегистрации",		НачалоМесяца(ПериодРегистрации));
//	Запрос.УстановитьПараметр("парамНачалоГодаРегистрации",	НачалоГода(ПериодРегистрации));
//	Запрос.УстановитьПараметр("парамСтавка13",                     Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
//		//Запрос.УстановитьПараметр("парамСтавкаРезидента13", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13) / 100);
//		
//		Запрос.УстановитьПараметр("парамКонецМесяцаНалоговогоПериода", КонецМесяца(ПериодРегистрации));
//		//Островская Татьяна 14.11.2012 № 15
//		Запрос.УстановитьПараметр("парамМесяцаНалоговогоПер", НачалоМесяца(ПериодРегистрации));
//		Запрос.УстановитьПараметр("парамМесяцаНалоговогоПер1", КонецМесяца(ПериодРегистрации));
//		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);

//		//Островская Татьяна 14.11.2012 № 15
//		Запрос.УстановитьПараметр("парамКонецМесяцаПериодРегистрации", КонецМесяца(ПериодРегистрации));
//		Запрос.УстановитьПараметр("парамНачалоГода",                   НачалоМесяца(ПериодРегистрации));
//		Запрос.УстановитьПараметр("парамКонецГода",                    КонецМесяца(ПериодРегистрации));
//		Запрос.УстановитьПараметр("парамПриход",                       ВидДвиженияНакопления.Приход);
//		Запрос.УстановитьПараметр("парамВидСтроки",                    Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
//		Запрос.УстановитьПараметр("БазоваяВеличина",                   Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина);
//		
//		Запрос.УстановитьПараметр("КодВычета312", Справочники.ВычетыНДФЛ.Код640);
//		Запрос.УстановитьПараметр("КодВычета311", Справочники.ВычетыНДФЛ.Код650);
//		Запрос.УстановитьПараметр("КодВычета640Страх", Справочники.ВычетыНДФЛ.Код640Страх);

//		
//		КодыВычетовРезидентов = Новый Массив;
//		//Вычеты (льготы) кратные базовой величине
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код500);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код510);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код520);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код530);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код540);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код550);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код560);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код570);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код571);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код580);
//		//Расходы по авторским
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код404);
//		КодыВычетовРезидентов.Добавить(Справочники.ВычетыНДФЛ.Код405);
//		Запрос.УстановитьПараметр("КодыВычетовРезидентов", КодыВычетовРезидентов);

//	// установим дополнительные параметры
//	Если ДополнительныеПараметрыЗапроса <> Неопределено Тогда
//		Для каждого Поле Из ДополнительныеПараметрыЗапроса Цикл
//			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
//		КонецЦикла;
//	КонецЕсли;
//	МенеджерВТ = Новый МенеджерВременныхТаблиц;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ Физлицо
//	|ПОМЕСТИТЬ ВТСписокФизЛиц
//	|ИЗ (" + СписокФизЛицТекст + ") СписокФизЛиц
//	|ИНДЕКСИРОВАТЬ ПО Физлицо";
//	Запрос.Выполнить();
//	
//	НачМесяца = НачалоГода(ПериодРегистрации);
//	ДатыПоМесяцамТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
//	ДатыПоМесяцамТекстД = ДатыПоМесяцамТекст;
//	ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
//	|ПОМЕСТИТЬ ВТДатыПоМесяцам";
//	Пока НачМесяца < НачалоМесяца(ПериодРегистрации) Цикл
//		НачМесяца = НачалоМесяца(КонецМесяца(НачМесяца) + 1);
//		ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
//		ДатыПоМесяцамТекстД = ДатыПоМесяцамТекстД +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
//	КонецЦикла;
//	ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
//	|ИНДЕКСИРОВАТЬ ПО Период";
//	
//	Запрос.Текст = ДатыПоМесяцамТекстД;
//	
//	Запрос.Текст = ДатыПоМесяцамТекст;
//	Запрос.Выполнить();
//	
//	
//	Если ЭтоПерерасчет Тогда
//		
//		ПериодыТекст = 
//			"ВЫБРАТЬ
//			|	Работники.Физлицо,
//			|	Месяцы.Период
//			|ПОМЕСТИТЬ ВТПериоды
//			|ИЗ
//			|	ВТСписокФизЛиц КАК Работники
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПоМесяцам КАК Месяцы
//			|		ПО (ИСТИНА)
//			|ИНДЕКСИРОВАТЬ ПО Физлицо, Период";
//			
//			//ПериодыТекст1 = 
//			//"ВЫБРАТЬ
//			//|	Работники.Физлицо,
//			//|	Месяцы.Период
//			//|ИЗ
//			//|	ВТСписокФизЛиц КАК Работники
//			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПоМесяцам КАК Месяцы
//			//|		ПО (ИСТИНА)";
//		Иначе
//			
//			ПериодыТекст = 
//			"ВЫБРАТЬ
//			|	ПериодыДохода.ФизЛицо,
//			|	Месяцы.Период
//			|ПОМЕСТИТЬ ВТПериоды
//			|ИЗ
//			|	(ВЫБРАТЬ
//			|		НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо,
//			|		МАКСИМУМ(НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)) КАК ПериодМакс,
//			|		МИНИМУМ(ВЫБОР
//			|				КОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
//			|					ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, ГОД)
//			|				ИНАЧЕ &парамНачалоГодаРегистрации
//			|			КОНЕЦ) КАК ПериодМин
//			|	ИЗ
//			|		РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛиц КАК Работники
//			|		ПО Работники.Физлицо = НДФЛСведенияОДоходах.ФизЛицо
//			|	ГДЕ
//			|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.ПериодРегистрации, МЕСЯЦ)МЕЖДУ &парамНачалоГодаРегистрации И &парамПериодРегистрации
//			|		И НДФЛСведенияОДоходах.Организация = &парамОрганизация
//			|	
//			|	СГРУППИРОВАТЬ ПО
//			|		НДФЛСведенияОДоходах.ФизЛицо) КАК ПериодыДохода
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПоМесяцам КАК Месяцы
//			|		ПО (Месяцы.Период МЕЖДУ ПериодыДохода.ПериодМин И ПериодыДохода.ПериодМакс)
//			|ИНДЕКСИРОВАТЬ ПО Физлицо, Период";
//			//
//			ПериодыТекст1 = 
//			"ВЫБРАТЬ
//			|	ПериодыДохода.ФизЛицо,
//			|	Месяцы.Период
//			|ИЗ
//			|	(ВЫБРАТЬ
//			|		НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо,
//			|		МАКСИМУМ(НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)) КАК ПериодМакс,
//			|		МИНИМУМ(ВЫБОР
//			|				КОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
//			|					ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, ГОД)
//			|				ИНАЧЕ &парамНачалоГодаРегистрации
//			|			КОНЕЦ) КАК ПериодМин
//			|	ИЗ
//			|		РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛиц КАК Работники
//			|		ПО Работники.Физлицо = НДФЛСведенияОДоходах.ФизЛицо
//			|	ГДЕ
//			|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.ПериодРегистрации, МЕСЯЦ)  = &парамПериодРегистрации 
//			|		ИЛИ НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)  = &парамПериодРегистрации 
//			|		И НДФЛСведенияОДоходах.Организация = &парамОрганизация
//			|	
//			|	СГРУППИРОВАТЬ ПО
//			|		НДФЛСведенияОДоходах.ФизЛицо) КАК ПериодыДохода
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПоМесяцам КАК Месяцы
//			|		ПО (Месяцы.Период МЕЖДУ ПериодыДохода.ПериодМин И ПериодыДохода.ПериодМакс)";
//		КонецЕсли;
//		
//		Запрос.Текст = ПериодыТекст1;
//		
//		Запрос.Текст = ПериодыТекст;
//		Запрос.Выполнить();
//		ПериодыТекст = "ВТПериоды";
//		ДоходыСКодамиВычетов =
//		"ВЫБРАТЬ
//		|	НДФЛОбороты.Физлицо КАК ФизЛицо,
//		|	НДФЛОбороты.Период КАК Период,
//		|	НДФЛОбороты.КодДохода КАК КодДохода,
//		|	НДФЛОбороты.КодВычета КАК КодВычета,
//		|	СУММА(НДФЛОбороты.СуммаДоходаОборот) КАК СуммаДоходаОборот,
//		|	СУММА(НДФЛОбороты.СуммаВычетаОборот) КАК СуммаВычетаОборот
//		|ПОМЕСТИТЬ ВТДоходыСКодамиВычетов
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
//		|		НДФЛСведенияОДоходах.ФизЛицо КАК Физлицо,
//		|		НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
//		|		НДФЛСведенияОДоходах.КодВычета КАК КодВычета,
//		|		ЕСТЬNULL(СУММА(НДФЛСведенияОДоходах.СуммаДохода), 0) КАК СуммаДоходаОборот,
//		|		ЕСТЬNULL(СУММА(НДФЛСведенияОДоходах.СуммаВычета), 0) КАК СуммаВычетаОборот
//		|	ИЗ
//		|		ВТПериоды КАК Периоды
//		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
//		|			ПО Периоды.Физлицо = НДФЛСведенияОДоходах.ФизЛицо
//		|				И (Периоды.Период = НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ))
//		|	ГДЕ
//		|		НДФЛСведенияОДоходах.Период >= &парамНачалоГода
//		|		И НДФЛСведенияОДоходах.Период <= &парамКонецМесяцаНалоговогоПериода
//		|		И НДФЛСведенияОДоходах.Организация = &парамОрганизация
//		|		И НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка13
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
//		|		НДФЛСведенияОДоходах.ФизЛицо,
//		|		НДФЛСведенияОДоходах.КодДохода,
//		|		НДФЛСведенияОДоходах.КодВычета) КАК НДФЛОбороты
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	НДФЛОбороты.Физлицо,
//		|	НДФЛОбороты.Период,
//		|	НДФЛОбороты.КодДохода,
//		|	НДФЛОбороты.КодВычета
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	ФизЛицо,
//		|	Период";
//		Запрос.Текст = ДоходыСКодамиВычетов;
//		Запрос.Выполнить();

//		
//		
//		ДоходыСКодамиВычетов11 =
//		"ВЫБРАТЬ
//		|	Периоды.Период КАК Период,
//		|	Периоды.Физлицо КАК ФизЛицо,
//		|	Периоды.Резидент КАК Резидент,
//		|	ВЫБОР
//		|		КОГДА НДФЛОбороты.Период = Периоды.Период
//		|			ТОГДА ВЫРАЗИТЬ((НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|						КОГДА Периоды.Резидент
//		|								ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|							ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|						ИНАЧЕ 0
//		|					КОНЕЦ) * 0.15 КАК ЧИСЛО(10, 0))
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК НалогНерезидента,
//		|	ВЫБОР
//		|		КОГДА НДФЛОбороты.Период = Периоды.Период
//		|			ТОГДА НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|					КОГДА Периоды.Резидент
//		|							ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|						ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|					ИНАЧЕ 0
//		|				КОНЕЦ
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК ОблагаемыйДоходЗаПериод,
//		|	НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|		КОГДА Периоды.Резидент
//		|				ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|			ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК ОблагаемыйДоходЗаГод
//		|ИЗ
//		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|		ПериодФизлицо.Период КАК Период,
//		|		ПериодФизлицо.Физлицо КАК Физлицо,
//		|		ВЫБОР
//		|			КОГДА ФизлицаНеРезиденты.Физлицо ЕСТЬ NULL 
//		|				ТОГДА ИСТИНА
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ КАК Резидент
//		|	ИЗ
//		|		ВТПериоды КАК ПериодФизлицо
//		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		|				ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		|				ГражданствоПоГодам.ПериодФизлица КАК Период
//		|			ИЗ
//		|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|						ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		|						Физлица.Период КАК ПериодФизлица,
//		|						МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
//		|					ИЗ
//		|						РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Физлица
//		|							ПО (Физлица.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
//		|								И (ГражданствоФизЛиц.Период <= ВЫБОР
//		|									КОГДА КОНЕЦПЕРИОДА(Физлица.Период, ГОД) >= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		|										ТОГДА КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		|									ИНАЧЕ КОНЕЦПЕРИОДА(Физлица.Период, ГОД)
//		|								КОНЕЦ)
//		|					
//		|					СГРУППИРОВАТЬ ПО
//		|						ГражданствоФизЛиц.ФизЛицо,
//		|						Физлица.Период) КАК ГражданствоПоГодам
//		|					ПО (ГражданствоПоГодам.Физлицо = ГражданствоФизЛиц.ФизЛицо)
//		|						И (ГражданствоПоГодам.Период = ГражданствоФизЛиц.Период)
//		|			ГДЕ
//		|				ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ) КАК ФизлицаНеРезиденты
//		|			ПО (ФизлицаНеРезиденты.Физлицо = ПериодФизлицо.Физлицо)
//		|				И (ФизлицаНеРезиденты.Период = ПериодФизлицо.Период)) КАК Периоды
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыСКодамиВычетов КАК НДФЛОбороты
//		|		ПО (НДФЛОбороты.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
//		|			И Периоды.Физлицо = НДФЛОбороты.Физлицо";
//		Запрос.Текст = ДоходыСКодамиВычетов11;
//		Запрос.Выполнить();
//		
//		ДоходыСКодамиВычетов22 = 
//		"ВЫБРАТЬ
//		|	НДФЛОбороты.Период КАК Период,
//		|	НДФЛОбороты.ФизЛицо КАК ФизЛицо,
//		|	НДФЛОбороты.Резидент КАК Резидент,
//		|	СУММА(НДФЛОбороты.НалогНерезидента) КАК НалогНерезидента,
//		|	СУММА(НДФЛОбороты.ОблагаемыйДоходЗаПериод) КАК ОблагаемыйДоходЗаПериод,
//		|	СУММА(НДФЛОбороты.ОблагаемыйДоходЗаГод) КАК ОблагаемыйДоходЗаГод
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		Периоды.Период КАК Период,
//		|		Периоды.Физлицо КАК ФизЛицо,
//		|		Периоды.Резидент КАК Резидент,
//		|		ВЫБОР
//		|			КОГДА НДФЛОбороты.Период = Периоды.Период
//		|				ТОГДА ВЫРАЗИТЬ((НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|							КОГДА Периоды.Резидент
//		|									ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|								ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|							ИНАЧЕ 0
//		|						КОНЕЦ) * 0.15 КАК ЧИСЛО(10, 0))
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК НалогНерезидента,
//		|		ВЫБОР
//		|			КОГДА НДФЛОбороты.Период = Периоды.Период
//		|				ТОГДА НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|						КОГДА Периоды.Резидент
//		|								ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|							ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|						ИНАЧЕ 0
//		|					КОНЕЦ
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ОблагаемыйДоходЗаПериод,
//		|		НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		|			КОГДА Периоды.Резидент
//		|					ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		|				ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ОблагаемыйДоходЗаГод
//		|	ИЗ
//		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|			ПериодФизлицо.Период КАК Период,
//		|			ПериодФизлицо.Физлицо КАК Физлицо,
//		|			ВЫБОР
//		|				КОГДА ФизлицаНеРезиденты.Физлицо ЕСТЬ NULL 
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЛОЖЬ
//		|			КОНЕЦ КАК Резидент
//		|		ИЗ
//		|			ВТПериоды КАК ПериодФизлицо
//		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		|					ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		|					ГражданствоПоГодам.ПериодФизлица КАК Период
//		|				ИЗ
//		|					РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|							ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		|							Физлица.Период КАК ПериодФизлица,
//		|							МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
//		|						ИЗ
//		|							РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Физлица
//		|								ПО (Физлица.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
//		|									И (ГражданствоФизЛиц.Период <= ВЫБОР
//		|										КОГДА КОНЕЦПЕРИОДА(Физлица.Период, ГОД) >= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		|											ТОГДА КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		|										ИНАЧЕ КОНЕЦПЕРИОДА(Физлица.Период, ГОД)
//		|									КОНЕЦ)
//		|						
//		|						СГРУППИРОВАТЬ ПО
//		|							ГражданствоФизЛиц.ФизЛицо,
//		|							Физлица.Период) КАК ГражданствоПоГодам
//		|						ПО (ГражданствоПоГодам.Физлицо = ГражданствоФизЛиц.ФизЛицо)
//		|							И (ГражданствоПоГодам.Период = ГражданствоФизЛиц.Период)
//		|				ГДЕ
//		|					ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ) КАК ФизлицаНеРезиденты
//		|				ПО (ФизлицаНеРезиденты.Физлицо = ПериодФизлицо.Физлицо)
//		|					И (ФизлицаНеРезиденты.Период = ПериодФизлицо.Период)) КАК Периоды
//		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыСКодамиВычетов КАК НДФЛОбороты
//		|			ПО (НДФЛОбороты.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
//		|				И Периоды.Физлицо = НДФЛОбороты.Физлицо) КАК НДФЛОбороты
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	НДФЛОбороты.Период,
//		|	НДФЛОбороты.ФизЛицо,
//		|	НДФЛОбороты.Резидент";
//		Запрос.Текст = ДоходыСКодамиВычетов22;
//		Запрос.Выполнить();
//		
//		
//		
//		
//		НДФЛРасчеты = 
//		//"ВЫБРАТЬ
//		//|	Периоды.Период КАК Период,
//		//|	НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
//		//|	СУММА(ВЫБОР
//		//|			КОГДА ФизлицаНеРезиденты.Физлицо ЕСТЬ NULL 
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ИсчисленныйНалог, 0)
//		//|			КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ИсчисленныйНалог, 0)
//		//|		КОНЕЦ) КАК ИсчисленныйНалогЗаГод,
//		//|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПримененныеВычетыЛичные, 0)) КАК ПримененныеВычетыЛичные,
//		//|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетские, 0)) КАК ПримененныеВычетыДетские,
//		//|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетскиеЛьгота, 0)) КАК ПримененныеВычетыДетскиеЛьгота,
//		//|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДополнительные, 0)) КАК ПримененныеВычетыДополнительные,
//		//|	СУММА(ВЫБОР
//		//|			КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПримененныеВычетыЛичные, 0)
//		//|			ИНАЧЕ 0
//		//|		КОНЕЦ) КАК ПримененныеВычетыЛичныеЗаМесяц,
//		//|	СУММА(ВЫБОР
//		//|			КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетские, 0)
//		//|			ИНАЧЕ 0
//		//|		КОНЕЦ) КАК ПолеПримененныеВычетыДетскиеЗаМесяц,
//		//|	СУММА(ВЫБОР
//		//|			КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетскиеЛьгота, 0)
//		//|			ИНАЧЕ 0
//		//|		КОНЕЦ) КАК ПолеПримененныеВычетыДетскиеЛьготаЗаМесяц,
//		//|	СУММА(ВЫБОР
//		//|			КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		//|				ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДополнительные, 0)
//		//|			ИНАЧЕ 0
//		//|		КОНЕЦ) КАК ПолеПримененныеВычетыДополнительныеЗаМесяц
//		//|ИЗ
//		//|	ВТПериоды КАК Периоды
//		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		//|			НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
//		//|			НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
//		//|			СУММА(НДФЛРасчетыСБюджетом.Налог) КАК ИсчисленныйНалог,
//		//|			СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетЛичный) КАК ПримененныеВычетыЛичные,
//		//|			СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетей) КАК ПолеПримененныеВычетыДетские,
//		//|			СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейЛьгота) КАК ПолеПримененныеВычетыДетскиеЛьгота,
//		//|			СУММА(НДФЛРасчетыСБюджетом.ПримененныйДополнительныйВычет) КАК ПолеПримененныеВычетыДополнительные
//		//|		ИЗ
//		//|			РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
//		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛиц КАК РаботникиОрганизации
//		//|				ПО (РаботникиОрганизации.Физлицо = НДФЛРасчетыСБюджетом.ФизЛицо)
//		//|		ГДЕ
//		//|			НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &парамМесяцаНалоговогоПер И &парамМесяцаНалоговогоПер1
//		//|			И НДФЛРасчетыСБюджетом.Организация = &парамОрганизация
//		//|			И НДФЛРасчетыСБюджетом.Регистратор <> &парамРегистратор
//		//|			И НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
//		//|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка13
//		//|			И НДФЛРасчетыСБюджетом.ВидСтроки = &парамВидСтроки
//		//|		
//		//|		СГРУППИРОВАТЬ ПО
//		//|			НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
//		//|			НДФЛРасчетыСБюджетом.ФизЛицо) КАК НДФЛРасчетыСБюджетом
//		//|		ПО (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
//		//|			И Периоды.Физлицо = НДФЛРасчетыСБюджетом.ФизЛицо
//		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		//|			ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		//|			ГражданствоПоГодам.ПериодФизлица КАК Период
//		//|		ИЗ
//		//|			РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//		//|					ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		//|					Физлица.Период КАК ПериодФизлица,
//		//|					МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
//		//|				ИЗ
//		//|					РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		//|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Физлица
//		//|						ПО (Физлица.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
//		//|							И (ГражданствоФизЛиц.Период <= ВЫБОР
//		//|								КОГДА КОНЕЦПЕРИОДА(Физлица.Период, ГОД) >= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		//|									ТОГДА КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		//|								ИНАЧЕ КОНЕЦПЕРИОДА(Физлица.Период, ГОД)
//		//|							КОНЕЦ)
//		//|				
//		//|				СГРУППИРОВАТЬ ПО
//		//|					ГражданствоФизЛиц.ФизЛицо,
//		//|					Физлица.Период) КАК ГражданствоПоГодам
//		//|				ПО (ГражданствоПоГодам.Физлицо = ГражданствоФизЛиц.ФизЛицо)
//		//|					И (ГражданствоПоГодам.Период = ГражданствоФизЛиц.Период)
//		//|		ГДЕ
//		//|			ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ) КАК ФизлицаНеРезиденты
//		//|		ПО (ФизлицаНеРезиденты.Физлицо = Периоды.Физлицо)
//		//|			И (ФизлицаНеРезиденты.Период = Периоды.Период)
//		//|
//		//|СГРУППИРОВАТЬ ПО
//		//|	Периоды.Период,
//		//|	НДФЛРасчетыСБюджетом.ФизЛицо,
//		//|	ФизлицаНеРезиденты.Физлицо";
//		
//		
//		
//		 "ВЫБРАТЬ
//		 |	ВложенныйЗапрос.Период,
//		 |	ВложенныйЗапрос.ФизЛицо,
//		 |	ВложенныйЗапрос.ИсчисленныйНалогЗаГод,
//		 |	ВложенныйЗапрос.ПримененныеВычетыЛичные,
//		 |	ВложенныйЗапрос.ПримененныеВычетыДетские,
//		 |	ВложенныйЗапрос.ПримененныеВычетыДетскиеЛьгота,
//		 |	ВложенныйЗапрос.ПримененныеВычетыДополнительные,
//		 |	ВложенныйЗапрос.ПримененныеВычетыЛичныеЗаМесяц КАК ПримененныеВычетыЛичныеЗаПериод,
//		 |	ВложенныйЗапрос.ПолеПримененныеВычетыДетскиеЗаМесяц КАК ПримененныеВычетыДетскиеЗаПериод,
//		 |	ВложенныйЗапрос.ПолеПримененныеВычетыДетскиеЛьготаЗаМесяц КАК ПримененныеВычетыДетскиеЛьготаЗаПериод,
//		 |	ВложенныйЗапрос.ПолеПримененныеВычетыДополнительныеЗаМесяц КАК ПримененныеВычетыДополнительныеЗаПериод,
//		 |	ВложенныйЗапрос1.Резидент,
//		 |	ВложенныйЗапрос1.НалогНерезидента,
//		 |	ВложенныйЗапрос1.ОблагаемыйДоходЗаПериод КАК ДоходЗаПериод,
//		 |	ВложенныйЗапрос1.ОблагаемыйДоходЗаГод КАК ДоходЗаГод
//		 |ИЗ
//		 |	(ВЫБРАТЬ
//		 |		Периоды.Период КАК Период,
//		 |		НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
//		 |		СУММА(ВЫБОР
//		 |				КОГДА ФизлицаНеРезиденты.Физлицо ЕСТЬ NULL 
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ИсчисленныйНалог, 0)
//		 |				КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ИсчисленныйНалог, 0)
//		 |			КОНЕЦ) КАК ИсчисленныйНалогЗаГод,
//		 |		СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПримененныеВычетыЛичные, 0)) КАК ПримененныеВычетыЛичные,
//		 |		СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетские, 0)) КАК ПримененныеВычетыДетские,
//		 |		СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетскиеЛьгота, 0)) КАК ПримененныеВычетыДетскиеЛьгота,
//		 |		СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДополнительные, 0)) КАК ПримененныеВычетыДополнительные,
//		 |		СУММА(ВЫБОР
//		 |				КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПримененныеВычетыЛичные, 0)
//		 |				ИНАЧЕ 0
//		 |			КОНЕЦ) КАК ПримененныеВычетыЛичныеЗаМесяц,
//		 |		СУММА(ВЫБОР
//		 |				КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетские, 0)
//		 |				ИНАЧЕ 0
//		 |			КОНЕЦ) КАК ПолеПримененныеВычетыДетскиеЗаМесяц,
//		 |		СУММА(ВЫБОР
//		 |				КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДетскиеЛьгота, 0)
//		 |				ИНАЧЕ 0
//		 |			КОНЕЦ) КАК ПолеПримененныеВычетыДетскиеЛьготаЗаМесяц,
//		 |		СУММА(ВЫБОР
//		 |				КОГДА Периоды.Период = НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
//		 |					ТОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПолеПримененныеВычетыДополнительные, 0)
//		 |				ИНАЧЕ 0
//		 |			КОНЕЦ) КАК ПолеПримененныеВычетыДополнительныеЗаМесяц
//		 |	ИЗ
//		 |		ВТПериоды КАК Периоды
//		 |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		 |				НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
//		 |				НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
//		 |				СУММА(НДФЛРасчетыСБюджетом.Налог) КАК ИсчисленныйНалог,
//		 |				СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетЛичный) КАК ПримененныеВычетыЛичные,
//		 |				СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетей) КАК ПолеПримененныеВычетыДетские,
//		 |				СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейЛьгота) КАК ПолеПримененныеВычетыДетскиеЛьгота,
//		 |				СУММА(НДФЛРасчетыСБюджетом.ПримененныйДополнительныйВычет) КАК ПолеПримененныеВычетыДополнительные
//		 |			ИЗ
//		 |				РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
//		 |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛиц КАК РаботникиОрганизации
//		 |					ПО (РаботникиОрганизации.Физлицо = НДФЛРасчетыСБюджетом.ФизЛицо)
//		 |			ГДЕ
//		 |				НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &парамМесяцаНалоговогоПер И &парамМесяцаНалоговогоПер1
//		 |				И НДФЛРасчетыСБюджетом.Организация = &парамОрганизация
//		 |				И НДФЛРасчетыСБюджетом.Регистратор <> &парамРегистратор
//		 |				И НДФЛРасчетыСБюджетом.ВидДвижения = &парамПриход
//		 |				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка13
//		 |				И НДФЛРасчетыСБюджетом.ВидСтроки = &парамВидСтроки
//		 |			
//		 |			СГРУППИРОВАТЬ ПО
//		 |				НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
//		 |				НДФЛРасчетыСБюджетом.ФизЛицо) КАК НДФЛРасчетыСБюджетом
//		 |			ПО (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
//		 |				И Периоды.Физлицо = НДФЛРасчетыСБюджетом.ФизЛицо
//		 |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		 |				ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		 |				ГражданствоПоГодам.ПериодФизлица КАК Период
//		 |			ИЗ
//		 |				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		 |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//		 |						ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		 |						Физлица.Период КАК ПериодФизлица,
//		 |						МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
//		 |					ИЗ
//		 |						РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		 |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Физлица
//		 |							ПО (Физлица.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
//		 |								И (ГражданствоФизЛиц.Период <= ВЫБОР
//		 |									КОГДА КОНЕЦПЕРИОДА(Физлица.Период, ГОД) >= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		 |										ТОГДА КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		 |									ИНАЧЕ КОНЕЦПЕРИОДА(Физлица.Период, ГОД)
//		 |								КОНЕЦ)
//		 |					
//		 |					СГРУППИРОВАТЬ ПО
//		 |						ГражданствоФизЛиц.ФизЛицо,
//		 |						Физлица.Период) КАК ГражданствоПоГодам
//		 |					ПО (ГражданствоПоГодам.Физлицо = ГражданствоФизЛиц.ФизЛицо)
//		 |						И (ГражданствоПоГодам.Период = ГражданствоФизЛиц.Период)
//		 |			ГДЕ
//		 |				ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ) КАК ФизлицаНеРезиденты
//		 |			ПО (ФизлицаНеРезиденты.Физлицо = Периоды.Физлицо)
//		 |				И (ФизлицаНеРезиденты.Период = Периоды.Период)
//		 |	
//		 |	СГРУППИРОВАТЬ ПО
//		 |		Периоды.Период,
//		 |		НДФЛРасчетыСБюджетом.ФизЛицо,
//		 |		ФизлицаНеРезиденты.Физлицо) КАК ВложенныйЗапрос
//		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		 |			НДФЛОбороты.Период КАК Период,
//		 |			НДФЛОбороты.ФизЛицо КАК ФизЛицо,
//		 |			НДФЛОбороты.Резидент КАК Резидент,
//		 |			СУММА(НДФЛОбороты.НалогНерезидента) КАК НалогНерезидента,
//		 |			СУММА(НДФЛОбороты.ОблагаемыйДоходЗаПериод) КАК ОблагаемыйДоходЗаПериод,
//		 |			СУММА(НДФЛОбороты.ОблагаемыйДоходЗаГод) КАК ОблагаемыйДоходЗаГод
//		 |		ИЗ
//		 |			(ВЫБРАТЬ
//		 |				Периоды.Период КАК Период,
//		 |				Периоды.Физлицо КАК ФизЛицо,
//		 |				Периоды.Резидент КАК Резидент,
//		 |				ВЫБОР
//		 |					КОГДА НДФЛОбороты.Период = Периоды.Период
//		 |						ТОГДА ВЫРАЗИТЬ((НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		 |									КОГДА Периоды.Резидент
//		 |											ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		 |										ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		 |									ИНАЧЕ 0
//		 |								КОНЕЦ) * 0.15 КАК ЧИСЛО(10, 0))
//		 |					ИНАЧЕ 0
//		 |				КОНЕЦ КАК НалогНерезидента,
//		 |				ВЫБОР
//		 |					КОГДА НДФЛОбороты.Период = Периоды.Период
//		 |						ТОГДА НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		 |								КОГДА Периоды.Резидент
//		 |										ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		 |									ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		 |								ИНАЧЕ 0
//		 |							КОНЕЦ
//		 |					ИНАЧЕ 0
//		 |				КОНЕЦ КАК ОблагаемыйДоходЗаПериод,
//		 |				НДФЛОбороты.СуммаДоходаОборот - ВЫБОР
//		 |					КОГДА Периоды.Резидент
//		 |							ИЛИ НЕ НДФЛОбороты.КодВычета В (&КодыВычетовРезидентов)
//		 |						ТОГДА НДФЛОбороты.СуммаВычетаОборот
//		 |					ИНАЧЕ 0
//		 |				КОНЕЦ КАК ОблагаемыйДоходЗаГод
//		 |			ИЗ
//		 |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		 |					ПериодФизлицо.Период КАК Период,
//		 |					ПериодФизлицо.Физлицо КАК Физлицо,
//		 |					ВЫБОР
//		 |						КОГДА ФизлицаНеРезиденты.Физлицо ЕСТЬ NULL 
//		 |							ТОГДА ИСТИНА
//		 |						ИНАЧЕ ЛОЖЬ
//		 |					КОНЕЦ КАК Резидент
//		 |				ИЗ
//		 |					ВТПериоды КАК ПериодФизлицо
//		 |						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		 |							ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		 |							ГражданствоПоГодам.ПериодФизлица КАК Период
//		 |						ИЗ
//		 |							РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		 |								ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//		 |									ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
//		 |									Физлица.Период КАК ПериодФизлица,
//		 |									МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
//		 |								ИЗ
//		 |									РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
//		 |										ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Физлица
//		 |										ПО (Физлица.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
//		 |											И (ГражданствоФизЛиц.Период <= ВЫБОР
//		 |												КОГДА КОНЕЦПЕРИОДА(Физлица.Период, ГОД) >= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		 |													ТОГДА КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
//		 |												ИНАЧЕ КОНЕЦПЕРИОДА(Физлица.Период, ГОД)
//		 |											КОНЕЦ)
//		 |								
//		 |								СГРУППИРОВАТЬ ПО
//		 |									ГражданствоФизЛиц.ФизЛицо,
//		 |									Физлица.Период) КАК ГражданствоПоГодам
//		 |								ПО (ГражданствоПоГодам.Физлицо = ГражданствоФизЛиц.ФизЛицо)
//		 |									И (ГражданствоПоГодам.Период = ГражданствоФизЛиц.Период)
//		 |						ГДЕ
//		 |							ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ) КАК ФизлицаНеРезиденты
//		 |						ПО (ФизлицаНеРезиденты.Физлицо = ПериодФизлицо.Физлицо)
//		 |							И (ФизлицаНеРезиденты.Период = ПериодФизлицо.Период)) КАК Периоды
//		 |					ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыСКодамиВычетов КАК НДФЛОбороты
//		 |					ПО (НДФЛОбороты.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
//		 |						И Периоды.Физлицо = НДФЛОбороты.Физлицо) КАК НДФЛОбороты
//		 |		ГДЕ
//		 |			НДФЛОбороты.НалогНерезидента > 0
//		 |			И НДФЛОбороты.ОблагаемыйДоходЗаПериод > 0
//		 |			И НДФЛОбороты.ОблагаемыйДоходЗаГод > 0
//		 |		
//		 |		СГРУППИРОВАТЬ ПО
//		 |			НДФЛОбороты.Период,
//		 |			НДФЛОбороты.ФизЛицо,
//		 |			НДФЛОбороты.Резидент) КАК ВложенныйЗапрос1
//		 |		ПО ВложенныйЗапрос.ФизЛицо = ВложенныйЗапрос1.ФизЛицо";
//		 Запрос.Текст = НДФЛРасчеты;
//		Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		
//	КонецФункции


// Заполняет набор записей по переданным данным расчета НДФЛ
//
// Параметры: 
//  НаборЗаписей - набор записей регистра НДФЛРасчетыСБюджетом
//    ДанныеНДФЛ - таблица значений - данные расчета НДФЛ
//
// Возвращаемое значение:
//  Нет
//
Процедура ЗаполнитьНаборЗаписейПоДаннымНДФЛ(НаборЗаписей, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, Перерасчет = Ложь, ФизлицаСписок = Неопределено, КомментироватьРасчет = Ложь, ВыборкаПодразделений)
	
	УжеИсчислили = 0;
	УжеПрименилиЛичный = 0;
	УжеПрименилиДетский = 0;
	УжеПрименилиДетскийИнвалидов = 0;
	ТекущееФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	ТекущийГод = 0;
	СтруктураПоиска = Новый Структура("Физлицо, МесяцНалоговогоПериода");

	// строим соответствие физлиц, по  которым считается НДФЛ и индексов их строк табличной части НДФЛ
	РаботникиДляРасчетаНДФЛ = Новый Соответствие;
	РасчетПоФизлицу = Ложь;
	ИндексСтрокиТаблицыНДФЛ = 0;
	
	Для Каждого Строка Из НДФЛ Цикл
		РаботникиДляРасчетаНДФЛ.Вставить(Строка.Физлицо);
	КонецЦикла;
	// очистим результаты расчета НДФЛ, которые находятся в табличной части документа
	НДФЛ.Очистить();
	
	//ЗапросШкала = Новый Запрос;
	//ЗапросШкала.Текст = "ВЫБРАТЬ
	//|	ШкалаПодоходногоНалогаСрезПоследних.Налог
	//|ИЗ
	//|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(&КонецПериода, ) КАК ШкалаПодоходногоНалогаСрезПоследних
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НижнийПредел";
	//ЗапросШкала.УстановитьПараметр("КонецПериода", ПериодРегистрации);
	//Шкала = ЗапросШкала.Выполнить().Выгрузить();

	Если КомментироватьРасчет Тогда
		КомментарийНДФЛ = ОбщегоНазначения.КомментарийРасчета("Расчет подоходного налога");
	КонецЕсли;
	
	СтруктураПоискаПодразделения = Новый Структура("Физлицо,Период");
		Пока ДанныеНДФЛ.Следующий() Цикл
			
			Если ТекущееФизлицо <> ДанныеНДФЛ.ФизЛицо ИЛИ ТекущийГод <> Год(ДанныеНДФЛ.Период) Тогда
				УжеИсчислили = 0;
				// уже примененные вычеты
				УжеПрименилиЛичный = 0;
				УжеПрименилиДетский = 0;
				УжеПрименилиДетскийЛьгота = 0;
				УжеПрименилиДополнительный = 0;
//толик				
				//ВычетыПримененные312ЗаМесяц = 0;
				//ВычетыПримененные311ЗаМесяц = 0;
				//ВычетыПримененные640СтрахЗаМесяц = 0;
				УжеПрименили312 = 0;
				УжеПрименили311 = 0;
				УжеПрименили640Страх = 0;
				// текущие физлицо и год периода
				ТекущееФизлицо = ДанныеНДФЛ.ФизЛицо;
				ТекущийГод = Год(ДанныеНДФЛ.Период);
			КонецЕсли;
			ВычетыПримененные312ЗаМесяц = 0;
			ВычетыПримененные311ЗаМесяц = 0;
			ВычетыПримененные640СтрахЗаМесяц = 0;
		    //Островская Татьяна 14.11.2012 № 15
			// первый проход
			//Островская Татьяна 31.03.2014
			ВычетыПримененныеЛичный = ДанныеНДФЛ.РанееПримененныеВычетыЛичныеЗаМесяц;
			//- ДанныеНДФЛ.РанееПримененныеВычетыЛичные - УжеПрименилиЛичный;
			ВычетыПримененныеДетский = ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЗаМесяц;
			//- ДанныеНДФЛ.РанееПримененныеВычетыДетские - УжеПрименилиДетский;
			ВычетыПримененныеДетскийЛьгота = ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьготаЗаМесяц;
			//- ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьгота  - УжеПрименилиДетскийЛьгота;
			ВычетыПримененныеДополнительный =  ДанныеНДФЛ.РанееПримененныеВычетыДополнительныеЗаМесяц;
			//Островская Татьяна 31.03.2014
			//- ДанныеНДФЛ.РанееПримененныеВычетыДополнительные - УжеПрименилиДополнительный;
			//Островская Татьяна 14.11.2012 № 15
			ДоходЗаПериодДляВычета = ДанныеНДФЛ.ДоходЗаПериод - (ДанныеНДФЛ.РанееПримененныеВычетыЛичныеЗаМесяц + ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЗаМесяц  + ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьготаЗаМесяц + ДанныеНДФЛ.РанееПримененныеВычетыДополнительныеЗаМесяц);//Островская Татьяна 31.03.2014
			ОграничениеНДФЛ = РегистрыСведений.НДФЛРазмерВычетов.ПолучитьПоследнее(ДанныеНДФЛ.Период, Новый Структура("КодВычета",Справочники.ВычетыНДФЛ.Код640страх)).ОграничениеПоДоходам;
			
			//БазоваяВеличина = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДанныеНДФЛ.Период),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина)).Размер;
			//Если БазоваяВеличина = 0 тогда 
			//	Сообщить("Не заданна базовая величина");
			//Иначе
			
			Вычеты640СтрахОстаток = ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц;
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты640СтрахОстаток > ДоходЗаПериодДляВычета тогда
					Если ДоходЗаПериодДляВычета > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = ДоходЗаПериодДляВычета;
					КонецЕсли;
				Иначе
					Если Вычеты640СтрахОстаток > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = Вычеты640СтрахОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//КонецЕсли;
			//Островская Татьяна 09.03.2014 № 17170

			

			Вычеты312Остаток = ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц;//Островская Татьяна 31.03.2014
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты312Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц тогда
					ВычетыПримененные312ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц;
				Иначе
					ВычетыПримененные312ЗаМесяц = Вычеты312Остаток;
				КонецЕсли;
			КонецЕсли;
			
			Вычеты311Остаток = ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;//Островская Татьяна 31.03.2014
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты311Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц тогда 
					ВычетыПримененные311ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц;
				Иначе
					ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеНДФЛ.Резидент Тогда
				//Островская Татьяна 14.11.2012 № 15
				НалогИсчисленный = ДанныеНДФЛ.НалогРанееИсчисленный;
				//((ДанныеНДФЛ.ДоходЗаГод - ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота - ДанныеНДФЛ.ПримененныеВычетыДополнительные - (ВычетыПримененные640СтрахЗаМесяц + УжеПрименили640Страх) - (ВычетыПримененные312ЗаМесяц + УжеПрименили312) - (ВычетыПримененные311ЗаМесяц + УжеПрименили311))*ОКР(Шкала[0].Налог/100,2,0) - ДанныеНДФЛ.НалогРанееИсчисленный) - УжеИсчислили;
				//Островская Татьяна 14.11.2012 № 15
				НалогИсчисленный = ОбщегоНазначения.ОкруглитьПоВалюте(НалогИсчисленный,Константы.ВалютаРегламентированногоУчета.Получить());
			Иначе
				НалогИсчисленный = ДанныеНДФЛ.НалогИсчисленный;
			КонецЕсли;
			//Островская Татьяна 14.11.2012 № 15
			ВычетыПримененные640Страх = ВычетыПримененные640СтрахЗаМесяц;
			//Мин(ВычетыПримененные640СтрахЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц,ОграничениеНДФЛ-ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц); //Островская Татьяна 11.03.2014 № 17170
			ВычетыПримененные312 = ВычетыПримененные312ЗаМесяц; 
			//- ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц;
			ВычетыПримененные311 = ВычетыПримененные311ЗаМесяц; 
			//- ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
			//Островская Татьяна 14.11.2012 № 15	
				// Запомним суммы для следующей итерации
			УжеИсчислили = УжеИсчислили + НалогИсчисленный;
			УжеПрименилиЛичный = УжеПрименилиЛичный + ВычетыПримененныеЛичный;
			УжеПрименилиДетский = УжеПрименилиДетский + ВычетыПримененныеДетский;
			УжеПрименилиДетскийЛьгота = УжеПрименилиДетскийЛьгота + ВычетыПримененныеДетскийЛьгота;
			УжеПрименилиДополнительный = УжеПрименилиДополнительный + ВычетыПримененныеДополнительный;
			УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
			УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311ЗаМесяц;
			УжеПрименили640Страх = УжеПрименили640Страх + ВычетыПримененные640СтрахЗаМесяц;
			
			Если	НалогИсчисленный = 0 и 
					ВычетыПримененныеЛичный = 0 и 
					ВычетыПримененныеДетский = 0 и 
					ВычетыПримененныеДетскийЛьгота = 0 и
					ВычетыПримененныеДополнительный = 0 и
					ВычетыПримененные640Страх = 0 и
					ВычетыПримененные312 = 0 и 
					ВычетыПримененные311 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Ниже - заполняем табличную часть документа
			Если Перерасчет Тогда
				СтруктураПоиска.Физлицо = ДанныеНДФЛ.ФизЛицо;
				СтруктураПоиска.МесяцНалоговогоПериода = ДанныеНДФЛ.Период;
				Строки = НДФЛ.НайтиСтроки(СтруктураПоиска);
				Если Строки.Количество() > 0 Тогда
					Строка = Строки[0];
				Иначе
					Строка = НДФЛ.Добавить();
				КонецЕсли;
			Иначе
				Если РасчетПоФизлицу Тогда
					Строка = НДФЛ.Вставить(ИндексСтрокиТаблицыНДФЛ);
					ИндексСтрокиТаблицыНДФЛ = ИндексСтрокиТаблицыНДФЛ+1;
				Иначе
					Строка = НДФЛ.Добавить();
				КонецЕсли;
			КонецЕсли;
			РаботникиДляРасчетаНДФЛ.Удалить(ДанныеНДФЛ.ФизЛицо);
				
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПодразделения,ДанныеНДФЛ);
			ВыборкаПодразделений.Сбросить();
			Если ВыборкаПодразделений.НайтиСледующий(СтруктураПоискаПодразделения) Тогда
				Строка.ПодразделениеОрганизации	= ВыборкаПодразделений.ПодразделениеОрганизации;
			КонецЕсли;
			
			Строка.ФизЛицо 						= ДанныеНДФЛ.ФизЛицо;
			Строка.Налог   						= ОбщегоНазначения.ОкруглитьПоВалюте(НалогИсчисленный,Константы.ВалютаРегламентированногоУчета.Получить());
			Строка.ПримененныйВычетЛичный		= ВычетыПримененныеЛичный;
			Строка.ПримененныйВычетНаДетей		= ВычетыПримененныеДетский;
			Строка.ПримененныйВычетНаДетейЛьгота	= ВычетыПримененныеДетскийЛьгота;
			Строка.ПримененныйВычетДополнительный   = ВычетыПримененныеДополнительный;
			Строка.ПримененныйВычетИмущественныйРасход		= ВычетыПримененные311;
			Строка.ПримененныйВычетСоциальныйСПроцентами		= ВычетыПримененные312;
			Строка.ПримененныйВычетСтраховойРасход		= ВычетыПримененные640Страх; //Островская Татьяна 11.03.2014 № 17192
			Строка.МесяцНалоговогоПериода 		= ДанныеНДФЛ.Период;
			
		КонецЦикла;
	
	// заполним НДФЛ
	Для Каждого Элемент Из РаботникиДляРасчетаНДФЛ Цикл
		НоваяСтрока = НДФЛ.Добавить();
		НоваяСтрока.ФизЛицо = Элемент.Ключ;
		НоваяСтрока.МесяцНалоговогоПериода = НачалоМесяца(ПериодРегистрации);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНаборЗаписейПоДаннымНДФЛ()
